keithjasper83/3AxisGimbalManual-Gryo/esp32_firmware/src/Domain/GimbalController.h
#pragma once
#include <Arduino.h>
#include <ESP32Servo.h>
#include "PIDController.h"
#include "../Services/ConfigManager.h"

struct GimbalPosition {
    float yaw;
    float pitch;
    float roll;
};

class GimbalController {
public:
    GimbalController(ConfigManager& configManager);
    void begin();
    void update(float dt, float gyroYaw, float gyroPitch, float gyroRoll);

    void setMode(int mode);
    int getMode();

    void setManualPosition(float yaw, float pitch, float roll);
    void setAutoTarget(float yaw, float pitch, float roll);

    GimbalPosition getCurrentPosition();
    void center();

    void startTimedMove(float duration, GimbalPosition endPos);

private:
    ConfigManager& _configManager;
    Servo _servoYaw, _servoPitch, _servoRoll;
    PIDController _pidYaw, _pidPitch, _pidRoll;

    GimbalPosition _currentPos;
    GimbalPosition _targetPos;
    GimbalPosition _autoTarget;

    // Timed Move State
    bool _moveActive;
    unsigned long _moveStartTime;
    float _moveDuration;
    GimbalPosition _moveStartPos;
    GimbalPosition _moveEndPos;

    SemaphoreHandle_t _mutex;

    void updateServos(const AppConfig& config);
    void updateAuto(float dt, float gyroYaw, float gyroPitch, float gyroRoll);
    void updateTimedMove();
};
